# tap
tap 'homebrew/core'
tap 'homebrew/bundle'
tap 'homebrew/science'

tap 'caskroom/cask'
tap 'caskroom/versions'

# essentials
brew 'zsh'
brew 'git'
brew 'hub'
brew 'mas'
brew 'sbt'
brew 'vim'
brew 'tmux'
brew 'tree'
brew 'wget'
brew 'watch'
brew 'heroku'
brew 'httpie'
brew 'gnupg21'
brew 'git-flow'
brew 'mercurial'
brew 'terminal-notifier'

# dev environment
cask 'docker'

cask 'java'

brew 'rbenv'
brew 'ruby-build'

brew 'pyenv'
brew 'pyenv-virtualenvwrapper'

brew 'nvm'

brew 'swiftlint'

# package manager
brew 'carthage'

# apps
cask 'atom'
cask 'flux'
cask 'gitup'
cask 'slack'
cask 'skype'
cask 'firefox'
cask 'licecap'
cask 'macdown'
cask 'grammarly'
cask 'handbrake'
cask 'spectacle'
cask 'appcleaner'
cask 'teamviewer'
cask 'eclipse-jee'
cask 'gfxcardstatus'
cask 'google-chrome'
cask 'the-unarchiver'
caks 'veertu-desktop'
cask 'application-loader'

# quicklook enhancement
cask 'qlcolorcode'
cask 'quicklook-csv'
cask 'quicklook-json'

# games
cask 'openemu'
