# tap
tap 'homebrew/core'
tap 'homebrew/bundle'

tap 'homebrew/cask'
tap 'homebrew/cask-versions'

# essentials
brew 'zsh'
brew 'git'
brew 'hub'
brew 'vim'
brew 'tmux'
brew 'tree'
brew 'wget'
brew 'watch'
brew 'heroku'
brew 'httpie'
brew 'gnupg'
brew 'pinentry-mac'
brew 'git-flow'
brew 'mercurial'
brew 'terminal-notifier'

# dev environment
cask 'java'

brew 'rbenv'
brew 'ruby-build'

brew 'pyenv'

brew 'nvm'

# apps
cask 'flux'
cask 'gitup'
cask 'slack'
cask 'skype'
cask 'firefox'
cask 'iina'
cask 'licecap'
cask 'macdown'
cask 'overkill'
cask 'grammarly'
cask 'handbrake'
cask 'spectacle'
cask 'appcleaner'
cask 'teamviewer'
cask 'the-unarchiver'
cask 'visual-studio-code'

# quicklook enhancement
cask 'qlcolorcode'
cask 'quicklook-csv'
cask 'quicklook-json'
