# tap
tap 'homebrew/core'
tap 'homebrew/bundle'

# essentials
brew 'zsh'
brew 'gh'
brew 'git'
brew 'vim'
brew 'tldr'
brew 'tmux'
brew 'tree'
brew 'wget'
brew 'watch'
brew 'gnupg'
brew 'pinentry-mac'
brew 'terminal-notifier'

# dev environment
brew 'rbenv'
brew 'ruby-build'

brew 'go'

# apps
cask 'flux'
cask 'gitup'
cask 'slack'
cask 'skype'
cask 'firefox'
cask 'iina'
cask 'licecap'
cask 'macdown'
cask 'grammarly'
cask 'handbrake'
cask 'spectacle'
cask 'appcleaner'
cask 'teamviewer'
cask 'the-unarchiver'
cask 'visual-studio-code'

# quicklook enhancement
cask 'qlcolorcode'
cask 'quicklook-csv'
cask 'quicklook-json'
